feaser/openblt/stm32c0_port/Target/Demo/TRICORE_TC2_TC275_Lite_Kit_ADS/Boot/Libraries/Infra/Sfr/TC27D/_Reg/IfxDsadc_regdef.h
/** \brief  Integration Window Control Register */
typedef struct _Ifx_DSADC_CH_IWCTR_Bits
{
    unsigned int NVALCNT:6;                 /**< \brief [5:0] Number of Values Counted (rh) */
    unsigned int reserved_6:1;              /**< \brief \internal Reserved */
    unsigned int INTEN:1;                   /**< \brief [7:7] Integration Enable (rh) */
    unsigned int REPCNT:4;                  /**< \brief [11:8] Integration Cycle Counter (rh) */
    unsigned int REPVAL:4;                  /**< \brief [15:12] Number of Integration Cycles (rw) */
    unsigned int NVALDIS:6;                 /**< \brief [21:16] Number of Values Discarded (rw) */
    unsigned int reserved_22:1;             /**< \brief \internal Reserved */
    unsigned int IWS:1;                     /**< \brief [23:23] Integration Window Size (rw) */
    unsigned int NVALINT:6;                 /**< \brief [29:24] Number of Values Integrated (rw) */
    unsigned int reserved_30:2;             /**< \brief \internal Reserved */
} Ifx_DSADC_CH_IWCTR_Bits;

/** \brief  Modulator Configuration Register */
typedef struct _Ifx_DSADC_CH_MODCFG_Bits
{
    unsigned int INCFGP:2;                  /**< \brief [1:0] Configuration of Positive Input Line (rw) */
    unsigned int INCFGN:2;                  /**< \brief [3:2] Configuration of Negative Input Line (rw) */
    unsigned int GAINSEL:4;                 /**< \brief [7:4] Gain Select of Analog Input Path (rw) */
    unsigned int INSEL:2;                   /**< \brief [9:8] Input Pin Selection (rw) */
    unsigned int INMUX:2;                   /**< \brief [11:10] Input Multiplexer Setting (rh) */
    unsigned int INMODE:2;                  /**< \brief [13:12] Input Multiplexer Control Mode (rw) */
    unsigned int INMAC:1;                   /**< \brief [14:14] Input Multiplexer Action Control (rw) */
    unsigned int INCWC:1;                   /**< \brief [15:15] Write Control for Input Parameters (w) */
    unsigned int DIVM:4;                    /**< \brief [19:16] Divider Factor for Modulator Clock (rw) */
    unsigned int reserved_20:3;             /**< \brief \internal Reserved */
    unsigned int DWC:1;                     /**< \brief [23:23] Write Control for Divider Factor (w) */
    unsigned int CMVS:2;                    /**< \brief [25:24] Common Mode Voltage Selection (rw) */
    unsigned int MCFG:2;                    /**< \brief [27:26] Modulator Configuration (rw) */
    unsigned int GCEN:1;                    /**< \brief [28:28] Gain Calibration Enable (rw) */
    unsigned int APC:1;                     /**< \brief [29:29] Automatic Power Control (rw) */
    unsigned int reserved_30:1;             /**< \brief \internal Reserved */
    unsigned int MWC:1;                     /**< \brief [31:31] Write Control for Mode Selection (w) */
} Ifx_DSADC_CH_MODCFG_Bits;

/** \brief  Offset Register Main Filter */
typedef struct _Ifx_DSADC_CH_OFFM_Bits
{
    unsigned int OFFSET:16;                 /**< \brief [15:0] Offset Value (rw) */
    unsigned int reserved_16:16;            /**< \brief \internal Reserved */
} Ifx_DSADC_CH_OFFM_Bits;

/** \brief  Rectification Configuration Register */
typedef struct _Ifx_DSADC_CH_RECTCFG_Bits
{
    unsigned int RFEN:1;                    /**< \brief [0:0] Rectification Enable (rw) */
    unsigned int reserved_1:3;              /**< \brief \internal Reserved */
    unsigned int SSRC:2;                    /**< \brief [5:4] Sign Source (rw) */
    unsigned int reserved_6:9;              /**< \brief \internal Reserved */
    unsigned int SDCVAL:1;                  /**< \brief [15:15] Sign Delay Capture Valid Flag (rh) */
    unsigned int reserved_16:14;            /**< \brief \internal Reserved */
    unsigned int SGNCS:1;                   /**< \brief [30:30] Selected Carrier Sign Signal (rh) */
    unsigned int SGND:1;                    /**< \brief [31:31] Sign Signal Delayed (rh) */
} Ifx_DSADC_CH_RECTCFG_Bits;

/** \brief  Result Register Auxiliary Filter */
typedef struct _Ifx_DSADC_CH_RESA_Bits
{
    unsigned int RESULT:16;                 /**< \brief [15:0] Result of most recent conversion (rh) */
    unsigned int reserved_16:16;            /**< \brief \internal Reserved */
} Ifx_DSADC_CH_RESA_Bits;

/** \brief  Result Register Main Filter */
typedef struct _Ifx_DSADC_CH_RESM_Bits
{
    unsigned int RESULT:16;                 /**< \brief [15:0] Result of most recent conversion (rh) */
    unsigned int reserved_16:16;            /**< \brief \internal Reserved */
} Ifx_DSADC_CH_RESM_Bits;

/** \brief  Time-Stamp Register */
typedef struct _Ifx_DSADC_CH_TSTMP_Bits
{
    unsigned int RESULT:16;                 /**< \brief [15:0] Result of most recent conversion (rh) */
    unsigned int CFMDCNT:8;                 /**< \brief [23:16] CIC Filter (Main Chain) Decimation Counter (rh) */
    unsigned int NVALCNT:6;                 /**< \brief [29:24] Number of Values Counted (rh) */
    unsigned int TSVAL:1;                   /**< \brief [30:30] Timestamp Valid (rh) */
    unsigned int TSSR:1;                    /**< \brief [31:31] Timestamp Service Request (rw) */
} Ifx_DSADC_CH_TSTMP_Bits;

/** \brief  Clock Control Register */
typedef struct _Ifx_DSADC_CLC_Bits
{
    unsigned int DISR:1;                    /**< \brief [0:0] Module Disable Request Bit (rw) */
    unsigned int DISS:1;                    /**< \brief [1:1] Module Disable Status Bit (r) */
    unsigned int reserved_2:1;              /**< \brief \internal Reserved */
    unsigned int EDIS:1;                    /**< \brief [3:3] Sleep Mode Enable Control (rw) */
    unsigned int reserved_4:28;             /**< \brief \internal Reserved */
} Ifx_DSADC_CLC_Bits;

/** \brief  Event Flag Register */
typedef struct _Ifx_DSADC_EVFLAG_Bits
{
    unsigned int RESEV0:1;                  /**< \brief [0:0] Result Event (rwh) */
    unsigned int RESEV1:1;                  /**< \brief [1:1] Result Event (rwh) */
    unsigned int RESEV2:1;                  /**< \brief [2:2] Result Event (rwh) */
    unsigned int RESEV3:1;                  /**< \brief [3:3] Result Event (rwh) */
    unsigned int RESEV4:1;                  /**< \brief [4:4] Result Event (rwh) */
    unsigned int RESEV5:1;                  /**< \brief [5:5] Result Event (rwh) */
    unsigned int reserved_6:10;             /**< \brief \internal Reserved */
    unsigned int ALEV0:1;                   /**< \brief [16:16] Alarm Event (rwh) */
    unsigned int ALEV1:1;                   /**< \brief [17:17] Alarm Event (rwh) */
    unsigned int ALEV2:1;                   /**< \brief [18:18] Alarm Event (rwh) */
    unsigned int ALEV3:1;                   /**< \brief [19:19] Alarm Event (rwh) */
    unsigned int ALEV4:1;                   /**< \brief [20:20] Alarm Event (rwh) */
    unsigned int ALEV5:1;                   /**< \brief [21:21] Alarm Event (rwh) */
    unsigned int reserved_22:10;            /**< \brief \internal Reserved */
} Ifx_DSADC_EVFLAG_Bits;

/** \brief  Event Flag Clear Register */
typedef struct _Ifx_DSADC_EVFLAGCLR_Bits
{
    unsigned int RESEC0:1;                  /**< \brief [0:0] Result Event Clear (w) */
    unsigned int RESEC1:1;                  /**< \brief [1:1] Result Event Clear (w) */
    unsigned int RESEC2:1;                  /**< \brief [2:2] Result Event Clear (w) */
    unsigned int RESEC3:1;                  /**< \brief [3:3] Result Event Clear (w) */
    unsigned int RESEC4:1;                  /**< \brief [4:4] Result Event Clear (w) */
    unsigned int RESEC5:1;                  /**< \brief [5:5] Result Event Clear (w) */
    unsigned int reserved_6:10;             /**< \brief \internal Reserved */
    unsigned int ALEC0:1;                   /**< \brief [16:16] Alarm Event Clear (w) */
    unsigned int ALEC1:1;                   /**< \brief [17:17] Alarm Event Clear (w) */
    unsigned int ALEC2:1;                   /**< \brief [18:18] Alarm Event Clear (w) */
    unsigned int ALEC3:1;                   /**< \brief [19:19] Alarm Event Clear (w) */
    unsigned int ALEC4:1;                   /**< \brief [20:20] Alarm Event Clear (w) */
    unsigned int ALEC5:1;                   /**< \brief [21:21] Alarm Event Clear (w) */
    unsigned int reserved_22:10;            /**< \brief \internal Reserved */
} Ifx_DSADC_EVFLAGCLR_Bits;

/** \brief  Global Configuration Register */
typedef struct _Ifx_DSADC_GLOBCFG_Bits
{
    unsigned int MCSEL:3;                   /**< \brief [2:0] Modulator Clock Select (rw) */
    unsigned int reserved_3:8;              /**< \brief \internal Reserved */
    unsigned int IRM0:1;                    /**< \brief [11:11] Internal Resistance Measurement Control (rw) */
    unsigned int IRM2:1;                    /**< \brief [12:12] Internal Resistance Measurement Control (rw) */
    unsigned int IRM4:1;                    /**< \brief [13:13] Internal Resistance Measurement Control (rw) */
    unsigned int reserved_14:2;             /**< \brief \internal Reserved */
    unsigned int IBSEL:4;                   /**< \brief [19:16] Bias Current Select (rw) */
    unsigned int LOSUP:1;                   /**< \brief [20:20] Low Power Supply Voltage Select (rw) */
    unsigned int reserved_21:1;             /**< \brief \internal Reserved */
    unsigned int ICT:1;                     /**< \brief [22:22] Internal Channel Test (rw) */
    unsigned int PSWC:1;                    /**< \brief [23:23] Write Control for Power Supply Parameters (w) */
    unsigned int reserved_24:8;             /**< \brief \internal Reserved */
} Ifx_DSADC_GLOBCFG_Bits;

/** \brief  Global Run Control Register */
typedef struct _Ifx_DSADC_GLOBRC_Bits
{
    unsigned int CH0RUN:1;                  /**< \brief [0:0] Channel 0 Run Control (rw) */
    unsigned int CH1RUN:1;                  /**< \brief [1:1] Channel 1 Run Control (rw) */
    unsigned int CH2RUN:1;                  /**< \brief [2:2] Channel 2 Run Control (rw) */
    unsigned int CH3RUN:1;                  /**< \brief [3:3] Channel 3 Run Control (rw) */
    unsigned int CH4RUN:1;                  /**< \brief [4:4] Channel 4 Run Control (rw) */
    unsigned int CH5RUN:1;                  /**< \brief [5:5] Channel 5 Run Control (rw) */
    unsigned int reserved_6:10;             /**< \brief \internal Reserved */
    unsigned int M0RUN:1;                   /**< \brief [16:16] Modulator 0 Run Control (rw) */
    unsigned int M1RUN:1;                   /**< \brief [17:17] Modulator 1 Run Control (rw) */
    unsigned int M2RUN:1;                   /**< \brief [18:18] Modulator 2 Run Control (rw) */
    unsigned int M3RUN:1;                   /**< \brief [19:19] Modulator 3 Run Control (rw) */
    unsigned int M4RUN:1;                   /**< \brief [20:20] Modulator 4 Run Control (rw) */
    unsigned int M5RUN:1;                   /**< \brief [21:21] Modulator 5 Run Control (rw) */
    unsigned int reserved_22:10;            /**< \brief \internal Reserved */
} Ifx_DSADC_GLOBRC_Bits;

/** \brief  Common Mode Hold Voltage Register 0 */
typedef struct _Ifx_DSADC_GLOBVCMH0_Bits
{
    unsigned int IN0PVC0:1;                 /**< \brief [0:0] Voltage Control of Positive Input 0 of CH0 (rw) */
    unsigned int reserved_1:3;              /**< \brief \internal Reserved */
    unsigned int IN0NVC0:1;                 /**< \brief [4:4] Voltage Control of Negative Input 0 of CH0 (rw) */
    unsigned int reserved_5:3;              /**< \brief \internal Reserved */
    unsigned int IN1PVC0:1;                 /**< \brief [8:8] Voltage Control of Positive Input 0 of CH1 (rw) */
    unsigned int reserved_9:3;              /**< \brief \internal Reserved */
    unsigned int IN1NVC0:1;                 /**< \brief [12:12] Voltage Control of Negative Input 0 of CH1 (rw) */
    unsigned int reserved_13:3;             /**< \brief \internal Reserved */
    unsigned int IN2PVC0:1;                 /**< \brief [16:16] Voltage Control of Positive Inputs 0-1 of CH2 (rw) */
    unsigned int IN2PVC1:1;                 /**< \brief [17:17] Voltage Control of Positive Inputs 0-1 of CH2 (rw) */
    unsigned int reserved_18:2;             /**< \brief \internal Reserved */
    unsigned int IN2NVC0:1;                 /**< \brief [20:20] Voltage Control of Negative Inputs 0-1 of CH2 (rw) */
    unsigned int IN2NVC1:1;                 /**< \brief [21:21] Voltage Control of Negative Inputs 0-1 of CH2 (rw) */
    unsigned int reserved_22:2;             /**< \brief \internal Reserved */
    unsigned int IN3PVC0:1;                 /**< \brief [24:24] Voltage Control of Positive Inputs 0-3 of CH3 (rw) */
    unsigned int IN3PVC1:1;                 /**< \brief [25:25] Voltage Control of Positive Inputs 0-3 of CH3 (rw) */
    unsigned int IN3PVC2:1;                 /**< \brief [26:26] Voltage Control of Positive Inputs 0-3 of CH3 (rw) */
    unsigned int IN3PVC3:1;                 /**< \brief [27:27] Voltage Control of Positive Inputs 0-3 of CH3 (rw) */
    unsigned int IN3NVC0:1;                 /**< \brief [28:28] Voltage Control of Negative Inputs 0-3 of CH3 (rw) */
    unsigned int IN3NVC1:1;                 /**< \brief [29:29] Voltage Control of Negative Inputs 0-3 of CH3 (rw) */
    unsigned int IN3NVC2:1;                 /**< \brief [30:30] Voltage Control of Negative Inputs 0-3 of CH3 (rw) */
    unsigned int IN3NVC3:1;                 /**< \brief [31:31] Voltage Control of Negative Inputs 0-3 of CH3 (rw) */
} Ifx_DSADC_GLOBVCMH0_Bits;

/** \brief  Common Mode Hold Voltage Register 1 */
typedef struct _Ifx_DSADC_GLOBVCMH1_Bits
{
    unsigned int IN4PVC0:1;                 /**< \brief [0:0] Voltage Control of Positive Input 0 of CH4 (rw) */
    unsigned int reserved_1:3;              /**< \brief \internal Reserved */
    unsigned int IN4NVC0:1;                 /**< \brief [4:4] Voltage Control of Negative Input 0 of CH4 (rw) */
    unsigned int reserved_5:3;              /**< \brief \internal Reserved */
    unsigned int IN5PVC0:1;                 /**< \brief [8:8] Voltage Control of Positive Input 0 of CH5 (rw) */
    unsigned int reserved_9:3;              /**< \brief \internal Reserved */
    unsigned int IN5NVC0:1;                 /**< \brief [12:12] Voltage Control of Negative Input 0 of CH5 (rw) */
    unsigned int reserved_13:19;            /**< \brief \internal Reserved */
} Ifx_DSADC_GLOBVCMH1_Bits;

